# 데이터프레임 인덱스 조작

## 인덱스 설정 및 제거

In [3]:
import numpy as np
import pandas as pd

In [5]:
np.vstack([list("ABCDE"), np.round(np.random(3,5),2)])

TypeError: 'module' object is not callable

In [4]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [6]:
df2 = df1.set_index("C1")
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [8]:
df2.reset_index(inplace=True)
df2

   index C1    C2    C3    C4
0      0  A  0.55  0.65  0.79
1      1  B  0.72  0.44  0.53
2      2  C   0.6  0.89  0.57
3      3  D  0.54  0.96  0.93
4      4  E  0.42  0.38  0.07

### 연습문제 4.5.1
    - 5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

    학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. 
        reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.

    학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [11]:
np.random.seed(2021)
data = np.random.randint(40, 100, size=(5,3))
data

array([[92, 61, 97],
       [40, 85, 70],
       [62, 84, 67],
       [69, 61, 69],
       [64, 52, 94]])

In [12]:
df_score1 = pd.DataFrame(data, columns=["국어","영어","수학"])
df_score1

   국어  영어  수학
0  92  61  97
1  40  85  70
2  62  84  67
3  69  61  69
4  64  52  94

In [13]:
df_score1.index = ["Ailee","Elizabeth","James","Maria", "Brian"]
df_score1

           국어  영어  수학
Ailee      92  61  97
Elizabeth  40  85  70
James      62  84  67
Maria      69  61  69
Brian      64  52  94

In [14]:
df_score2 = df_score1.reset_index()
df_score2

       index  국어  영어  수학
0      Ailee  92  61  97
1  Elizabeth  40  85  70
2      James  62  84  67
3      Maria  69  61  69
4      Brian  64  52  94